Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: The fastener dispensing system of claim 11, wherein the fastener dispenser magazine comprises first and second retention devices (156, 157) for retaining the plurality of fasteners, and wherein the support handle comprises a magazine retention device (136) for removably coupling to the fastener dispenser magazine; or
de_de: Befestigungsmittel-Ausgabesystem nach Anspruch 11, wobei das Befestigungsmittelspendermagazin eine erste und eine zweite Haltevorrichtung (156, 157) zum Halten der Vielzahl von Befestigungsmitteln umfasst und wobei der Haltegriff eine Magazinhaltevorrichtung (136) zum abnehmbaren Koppeln mit dem Befestigungsmittelspendermagazin umfasst; oder

source: wherein the fastening tool is unattached to the support handle and the fastener dispenser magazine, and wherein the plurality of fasteners are unattached to each other.
de_de: wobei das Befestigungsmittelwerkzeug nicht an dem Haltegriff und an dem Befestigungsmittelspendermagazin angebracht ist und wobei die Vielzahl von Befestigungsmitteln nicht aneinander angebracht ist.

source: A method for making a fastener dispenser tool (100, 400), comprising:
de_de: Verfahren zum Herstellen eines Befestigungsmittelspenderwerkzeugs (100, 400), umfassend:

source: forming a support handle (102) configured to be held by an individual; and
de_de: Ausbilden eines Haltegriffs (102), der konfiguriert ist, um von einer Person gehalten zu werden; und

source: forming a fastener dispenser magazine (104, 204, 404) removably coupleable to the support handle, the fastener dispenser magazine comprising a retention section (144, 444) and a presentation section (146, 446) that extends from the retention section, and having a retention slot (148, 248, 448) extending along the retention section and the presentation section for retaining a plurality of fasteners (106, 206, 406) and a presentation slot (112, 212, 412) extending alongthe presentation section and at least part way into the retention section, the presentation slot sized to receive a tool bit (114) engageable with a lead fastener (106a, 406a) of the plurality of fasteners, and the presentation section configured such that the plurality of fasteners are slidable through the retention slot along the presentation section to facilitate dispensing of a lead fastener (106a, 406a) from the fastener dispenser magazine;
de_de: Ausbilden eines Befestigungsmittelspendermagazins (104, 204, 404), das abnehmbar mit dem Haltegriff koppelbar ist, wobei das Befestigungsmittelspendermagazin einen Haltebereich (144, 444) und einen Präsentationsbereich (146, 446) umfasst, der sich von dem Haltebereich erstreckt, und einen Halteschlitz (148, 248, 448) aufweist, der sich entlang des Haltebereichs und des Präsentationsbereichs erstreckt, um eine Vielzahl von Befestigungsmitteln (106, 206, 406) zu halten, und einen Präsentationsschlitz (112, 212, 412), der sich entlang des Präsentationsbereichs und mindestens teilweise in den Haltebereich hinein erstreckt, wobei der Präsentationsschlitz bemessen ist, um ein Werkzeugteil (114) aufzunehmen, das mit einem Hauptbefestigungsmittel (106a, 406a) der Vielzahl von Befestigungsmitteln verbindbar ist, und der Präsentationsbereich derart konfiguriert ist, dass die Vielzahl von Befestigungsmitteln durch den Halteschlitz entlang des Präsentationsbereichs schiebbar ist, um die Ausgabe eines Hauptbefestigungsmittels (106a, 406a) aus dem Befestigungsmittelspendermagazin zu erleichtern;

source: The method of claim 13, further comprising forming first and second retention devices (156, 157) of the fastener dispenser magazine for retaining the plurality of fasteners.
de_de: Verfahren nach Anspruch 13, das ferner das Ausbilden einer ersten und einer zweiten Haltevorrichtung (156, 157) des Befestigungsmittelspendermagazins zum Halten der Vielzahl von Befestigungsmitteln umfasst.

source: The method of claim 13, wherein forming the fastener dispenser magazine comprises forming the retention section comprising the retention slot, and forming the presentation section comprising the presentation slot and formed transverse relative to the retention section, such that the presentation slot is formed through an opposing side of the fastener dispenser magazine from a portion of the retention slot.
de_de: Verfahren nach Anspruch 13, wobei das Ausbilden des Befestigungsmittelspendermagazins das Ausbilden des Haltebereichs umfasst, der den Halteschlitz und das Ausbilden des Präsentationsbereichs mit dem Präsentationsschlitz umfasst, der quer zum Halteabschnitt derart ausgebildet ist, dass der Präsentationsschlitz durch eine gegenüberliegende Seite des Befestigungsmittelspendermagazins von einem Abschnitt des Halteschlitzes aus ausgebildet ist.

source: 1. A solenoid valve comprising:
de_de: 1. Magnetventil, umfassend:

source: a housing (110) defining an internal chamber (111); and
de_de: ein Gehäuse (110), das eine Innenkammer (111) definiert; und

source: a plunger assembly (120) comprising a valve seal (122) configured to selectively engage a corresponding valve seat, wherein the plunger assembly is moveably suspended within the internal chamber away from any sliding contact with adjacent surfaces by a first flexural washer cartridge disposed within the internal chamber and coupled to a first axial end portion of the plunger assembly (120) and a second flexural washer cartridge disposed within the internal chamber and coupled to a second axial end portion of the plunger assembly (120), wherein the first flexural washer cartridge and the second flexural washer cartridge each comprise:
de_de: eine Kolbenanordnung (120), die eine Ventildichtung (122) umfasst, die konfiguriert ist, um selektiv in einen entsprechenden Ventilsitz einzugreifen, wobei die Kolbenanordnung innerhalb der Innenkammer beweglich und von jeglichem Gleitkontakt mit benachbarten Oberflächen entfernt aufgehängt ist, durch eine erste Biegescheibenpatrone, die innerhalb der Innenkammer angeordnet und mit einem ersten axialen Endabschnitt der Kolbenanordnung (120) gekoppelt ist, und eine zweite Biegescheibenpatrone, die innerhalb der Innenkammer angeordnet und mit einem zweiten axialen Endabschnitt der Kolbenanordnung (120) gekoppelt ist, wobei die erste Biegescheibenpatrone und die zweite Biegescheibenpatrone jeweils umfassen:

source: a first flexural washer (130);
de_de: eine erste Biegescheibe (130);

source: a second flexural washer, wherein the first flexural washer and the second flexural washer each comprise:
de_de: eine zweite Biegescheibe, wobei die erste Biegescheibe und die zweite Biegescheibe jeweils umfassen:

source: a radially outward portion (132) mounted to the housing; and
de_de: einen radial äußeren Abschnitt (132), der an dem Gehäuse montiert ist; und

source: a radially inward portion (138) coupled to the plunger assembly;
de_de: einen radial inneren Abschnitt (138), der mit der Kolbenanordnung gekoppelt ist;

source: a radially intermediate portion disposed radially between the radially outward portion (132) and the radially inward portion (138), at least the radially intermediate portion (135) of the flexural washer is configured to resiliently flex to enable selective axial movement of the plunger assembly (120) in response to energizing a solenoid coil of the solenoid valve; and
de_de: einen radial mittlere Abschnitt, der radial zwischen dem radial äußeren Abschnitt (132) und dem radial inneren Abschnitt (138) angeordnet ist, wobei zumindest der radial mittlere Abschnitt (135) der Biegescheibe konfiguriert ist, um sich elastisch zu biegen, um eine selektive axiale Bewegung der Kolbenanordnung (120) als Reaktion auf die Erregung einer Magnetspule des Magnetventils zu ermöglichen; und

source: a first radially extending web segment (133) that extends radially between the radially outward portion and the radially intermediate portion, the first radially extending web segment comprising a first pair of radially extending web segments that are distributed 180 degrees apart along a first diameter (131A);
de_de: ein erstes sich radial erstreckendes Stegsegment (133), das sich radial zwischen dem radial äußeren Abschnitt und dem radial mittleren Abschnitt erstreckt, wobei das erste sich radial erstreckende Stegsegment ein erstes Paar sich radial erstreckender Stegsegmente umfasst, die um 180 Grad voneinander beabstandet entlang eines ersten Durchmessers (131A) verteilt sind;

source: a second radially extending web segment (137) that extends radially between the radially inward portion and the radially intermediate portion, the second radially extending web segment comprising a second pair of radially extending web segments that are distributed 180 degrees apart along a second diameter (131B);
de_de: ein zweites sich radial erstreckendes Stegsegment (137), das sich radial zwischen dem radial inneren Abschnitt und dem radial mittleren Abschnitt erstreckt, wobei das zweite sich radial erstreckende Stegsegment ein zweites Paar sich radial erstreckender Stegsegmente umfasst, die um 180 Grad voneinander beabstandet entlang eines zweiten Durchmessers (131B) verteilt sind;

source: wherein the radially outward portion (132) of the flexural washer is a radially outward ring;
de_de: wobei der radial äußere Abschnitt (132) der Biegescheibe ein radial äußerer Ring ist;

source: the radially intermediate portion (135) of the flexural washer includes a radially intermediate ring;
de_de: der radiale mittlere Abschnitt (135) der Biegescheibe einen radial mittleren Ring beinhaltet;

source: the radially inward portion (138) of the flexural washer is a radially inward ring;
de_de: der radial innere Abschnitt (138) der Biegescheibe ein radial innerer Ring ist;

source: the radially outward ring is connected to the radially intermediate ring via the first radially extending web segment (133); and
de_de: der radial äußere Ring über das erste sich radial erstreckende Stegsegment (133) mit dem radial mittleren Ring verbunden ist; und

source: the radially inward ring is connected to the radially intermediate ring via the second radially extending web segment (137);
de_de: der radial innere Ring über das zweite sich radial erstreckende Stegsegment (137) mit dem radial mittleren Ring verbunden ist;

source: a first radial cutout (134) defined between the radially outward ring (132) and the radially intermediate ring (135) along the first diameter (131A), with the first radially extending web segment (133) spanning the first radial cutout (134) and
de_de: einen ersten radialen Ausschnitt (134), der zwischen dem radial äußeren Ring (132) und dem radial mittleren Ring (135) entlang des ersten Durchmessers (131A) definiert ist, wobei das erste sich radial erstreckende Stegsegment (133) den ersten radialen Ausschnitt (134) überspannt, und

source: a second radial cutout (136) defined between the radially inward ring (138) and the radially intermediate ring (135) along the second diameter (131B), with the second radially extending web segment (137) spanning the second radial cutout (136);
de_de: einen zweiten radialen Ausschnitt (136), der zwischen dem radial inneren Ring (138) und dem radial mittleren Ring (135) entlang des zweiten Durchmessers (131B) definiert ist, wobei das zweite sich radial erstreckende Stegsegment (137) den zweiten radialen Ausschnitt (136) überspannt;

source: a radially outward axial spacer (151) disposed between the first flexural washer (130) and the second flexural washer; and
de_de: ein radial äußeres axiales Abstandsstück (151), das zwischen der ersten Biegescheibe (130) und der zweiten Biegescheibe angeordnet ist; und

source: a radial inward axial spacer (159) disposed between the first flexural washer (130) and the second flexural washer;
de_de: ein radial inneres axiales Abstandsstück (159), das zwischen der ersten Biegescheibe (130) und der zweiten Biegescheibe angeordnet ist;

source: wherein the radially inward axial spacer (159) is coupled to the plunger assembly (120),
de_de: wobei der radial innere axiale Abstandshalter (159) mit der Kolbenanordnung (120) gekoppelt ist,

source: wherein the radially outward axial spacer (151) is mounted to the housing (110); and wherein the first flexural washer and the second flexural washer prevent radial movement of the plunger assembly and enable selective axial movement in response to energizing the solenoid coil of the solenoid valve.
de_de: wobei der radial äußere axiale Abstandshalter (151) an dem Gehäuse (110) montiert ist; und wobei die erste Biegescheibe und die zweite Biegescheibe eine radiale Bewegung der Kolbenanordnung verhindern und eine selektive axiale Bewegung als Reaktion auf die Erregung der Magnetspule des Magnetventils ermöglichen.

source: 2. The solenoid valve of claim 1, wherein a radial gap (116) is defined between the plunger assembly and all non-moving, non-flexing features and surfaces of the solenoid valve.
de_de: 2. Magnetventil nach Anspruch 1, wobei zwischen der Kolbenanordnung und allen nicht beweglichen, nicht biegsamen Elementen und Oberflächen des Magnetventils ein radialer Spalt (116) definiert ist.

source: 3. The solenoid valve of claim 1, wherein the first diameter is offset 90 degrees from the second diameter.
de_de: 3. Magnetventil nach Anspruch 1, wobei der erste Durchmesser um 90 Grad von dem zweiten Durchmesser versetzt ist.

source: 4. The solenoid valve of any preceding claim, wherein the plunger assembly comprises a magnetic body portion, a non-magnetic plunger rod portion, and a valve poppet comprising the valve seat.
de_de: 4. Magnetventil nach einem der vorhergehenden Ansprüche, wobei die Kolbenanordnung einen magnetischen Körperabschnitt, einen nicht magnetischen Kolbenstangenabschnitt und einen Ventilteller umfasst, der den Ventilsitz umfasst.

source: 5. A solenoid valve as claimed in claim 1, wherein the plunger assembly is coupled to the radially inward portion of the flexural washer so as to be suspended within the internal chamber; and further comprising the solenoid coil disposed radially outward of the plunger assembly.
de_de: 5. Magnetventil nach Anspruch 1, wobei die Kolbenanordnung mit dem radial inneren Abschnitt der Biegescheibe gekoppelt ist, sodass sie in der Innenkammer aufgehängt ist; und ferner umfassend die Magnetspule, die radial außerhalb der Kolbenanordnung angeordnet ist.

source: 6. The solenoid valve of claim 5, wherein the flexural washer is resiliently flexible and is thus configured to enable selective axial movement of the plunger assembly in response to energizing the solenoid coil, and optionally wherein the flexural washer is configured to moveably suspend the plunger assembly within the internal chamber away from any sliding contact with adjacent surfaces.
de_de: 6. Magnetventil nach Anspruch 5, wobei die Biegescheibe elastisch flexibel ist und somit konfiguriert ist, um eine selektive axiale Bewegung der Kolbenanordnung als Reaktion auf die Erregung der Magnetspule zu ermöglichen, und wobei die Biegescheibe optional konfiguriert ist, um die Kolbenanordnung innerhalb der Innenkammer beweglich und von jeglichem Gleitkontakt mit benachbarten Oberflächen entfernt aufzuhängen.

source: 7. The solenoid valve of claim 6, wherein the plunger assembly is not in sliding contact with any of the adjacent surfaces.
de_de: 7. Magnetventil nach Anspruch 6, wobei die Kolbenanordnung nicht in Gleitkontakt mit einer der benachbarten Oberflächen steht.

source: 8. The solenoid valve of claim 6 and 7, wherein a radial gap is defined between the plunger assembly and all non-moving, non-flexing features and surfaces of the solenoid valve.
de_de: 8. Magnetventil nach Anspruch 6 und 7, wobei zwischen der Kolbenanordnung und allen nicht beweglichen, nicht biegsamen Elementen und Oberflächen des Magnetventils ein radialer Spalt definiert ist.

source: 9. A faucet system for an aircraft lavatory, the faucet system comprising a solenoid valve as claimed in claim 5.
de_de: 9. Wasserhahnsystem für eine Flugzeugtoilette, wobei das Wasserhahnsystem ein Magnetventil gemäß Anspruch 5 umfasst.

source: 1. An ice protection system comprising:
de_de: 1. Eisschutzsystem, umfassend:

source: an electrothermal heater configured to receive a current from a power source; and characterized by the electrothermal heater comprising a first plurality of metallized carbon nanotube, CNT, elements (212) disposed in a first direction and a second plurality of metallized carbon nanotube, CNT, elements in a second direction.
de_de: ein elektrothermisches Heizgerät, das konfiguriert ist, um einen Strom von einer Stromquelle zu empfangen; und dadurch gekennzeichnet, dass das elektrothermische Heizgerät eine erste Vielzahl von metallisierten Kohlenstoffnanoröhren-(CNT-)Elementen (212) umfasst, die in einer ersten Richtung angeordnet sind, und eine zweite Vielzahl von metallisierten Kohlenstoffnanoröhren-(CNT-)Elementen in einer zweiten Richtung.

source: 2. The ice protection system of claim 1, further comprising a blade (110), wherein the blade is a rotary blade for an aircraft, and wherein the electrothermal heater comprising an electric sheet resistivity between 0.01 and 0.5 ohms/square.
de_de: 2. Eisschutzsystem nach Anspruch 1, ferner ein Rotorblatt (110) umfassend, wobei das Rotorblatt ein Rotationsrotorblatt für ein Flugzeug ist und wobei das elektrothermische Heizgerät einen elektrischen Flächenwiderstand zwischen 0,01 und 0,5 Ohm pro Quadrat umfasst.

source: 3. The ice protection system of claim 1 or 2, wherein the first plurality of metallized CNT elements and the second plurality of metallized CNT elements form a metallized CNT fabric (210), or wherein the first plurality of metallized CNT elements and the second plurality of metallized CNT elements comprise a plurality of metallized CNT yarn (310), and optionally wherein the plurality of metallized CNT yarn form a woven pattern.
de_de: 3. Eisschutzsystem nach Anspruch 1 oder 2, wobei die erste Vielzahl von metallisierten CNT-Elementen und die zweite Vielzahl von metallisierten CNT-Elementen ein metallisiertes CNT-Gewebe (210) bilden oder wobei die erste Vielzahl von metallisierten CNT-Elementen und die zweite Vielzahl von metallisierten CNT-Elementen eine Vielzahl von metallisierten CNT-Garnen (310) umfassen und wobei optional die Vielzahl von metallisierten CNT-Garnen ein gewebtes Muster bildet.

source: 4. The ice protection system of any preceding claim, wherein the electrothermal heater comprises a metallic mesh (722) and a CNT yarn (310), and optionally wherein the CNT yarn is woven through the metallic mesh.
de_de: 4. Eisschutzsystem nach einem der vorhergehenden Ansprüche, wobei das elektrothermische Heizgerät ein Metallnetz (722) und ein CNT-Garn (310) umfasst und wobei das CNT-Garn optional durch das Metallnetz gewebt ist.

source: 5. A blade assembly, comprising:
de_de: 5. Rotorblattbaugruppe, umfassend:

source: an airfoil including a leading edge (116), a trailing edge (118), a pressure side and a suction side, the pressure side extending from the leading edge to the trailing edge, the suction side extending from the leading edge to the trailing edge; and
de_de: einen Tragflügel mit einer Vorderkante (116), einer Hinterkante (118), einer Druckseite und einer Saugseite, wobei sich die Druckseite von der Vorderkante zu der Hinterkante erstreckt und sich die Saugseite von der Vorderkante zu der Hinterkante erstreckt; und

source: an ice protection system (100) as claimed in any preceding claim, disposed on at least one of the leading edge, the pressure side, and the suction side, the electrothermal heater coupled to the airfoil, the CNT elements comprising a carbon nanotube, CNT, fabric (210) or a CNT yarn (310) and a metal coating (222) at least partially infiltrating pores of the CNT fabric or yarn.
de_de: ein Eisschutzsystem (100) nach einem der vorhergehenden Ansprüche, das an mindestens einer der Vorderkanten, der Druckseite und der Saugseite angeordnet ist, wobei das elektrothermische Heizgerät mit dem Tragflügel gekoppelt ist, die CNT-Elemente ein Kohlenstoffnanoröhren-(CNT-)Gewebe (210) oder ein CNT-Garn (310) und eine Metallbeschichtung (222) umfassen, die mindestens teilweise in die Poren des CNT-Gewebes oder -Garns eindringt.

source: 6. The blade assembly of claim 5, wherein the ice protection system is disposed on the leading edge.
de_de: 6. Rotorblattbaugruppe nach Anspruch 5, wobei das Eisschutzsystem an der Vorderkante angeordnet ist.

source: 7. The blade assembly of claim 5 or 6, wherein the CNT fabric or yarn undergoes a metallization process comprising at least one of electroplating, electroless plating, physical vapor deposition, chemical vapor deposition, and chemical deposition.
de_de: 7. Rotorblattbaugruppe nach Anspruch 5 oder 6, wobei das CNT-Gewebe oder -Garn einem Metallisierungsprozess unterzogen wird, der mindestens eines der folgenden Verfahren umfasst: Galvanotechnik, außenstromloses Plattieren, physikalische Gasphasenabscheidung, chemische Gasphasenabscheidung und chemische Abscheidung.

source: 8. The blade assembly of any of claims 5 to 7, wherein the electrothermal heater comprises an electric sheet resistivity between 0.01 and 0.5 ohms/square.
de_de: 8. Rotorblattbaugruppe nach einem der Ansprüche 5 bis 7, wobei das elektrothermische Heizgerät einen elektrischen Flächenwiderstand zwischen 0,01 und 0,5 Ohm pro Quadrat umfasst.

source: 9. The blade assembly of any of claims 5 to 8, wherein the airfoil is coupled to a main rotor (70).
de_de: 9. Rotorblattbaugruppe nach einem der Ansprüche 5 bis 8, wobei der Tragflügel mit einem Hauptrotor (70) gekoppelt ist.

source: The blade assembly of any of claims 5 to 9, wherein the metal coating (222) comprises at least one of copper, silver, nickel, aluminum, tin, and gold.
de_de: Rotorblattbaugruppe nach einem der Ansprüche 5 bis 9, wobei die Metallbeschichtung (222) mindestens eines der folgenden Elemente umfasst: Kupfer, Silber, Nickel, Aluminium, Zinn und Gold.

source: The blade assembly of any of claims 5 to 10, the electrothermal heater comprising a carbon nanotube, CNT, yarn (310) and further comprising a plurality of the CNT yarn, wherein the plurality of the CNT yarn forms a woven pattern.
de_de: Rotorblattbaugruppe nach einem der Ansprüche 5 bis 10, wobei das elektrothermische Heizgerät ein Kohlenstoffnanoröhren-(CNT-)Garn (310) umfasst und ferner eine Vielzahl von CNT-Garnen umfasst, wobei die Vielzahl von CNT-Garnen ein gewebtes Muster bildet.

source: Claims:
de_de: Patentansprüche:

source: 1. An overhead Passenger Service Unit, PSU system, the system comprising:
de_de: 1. Überkopf-Passagierservicesystem (PSU), das System umfassend:

source: an annular air gasper knob (102) of a UV transparent material, wherein the annular air gasper knob defines an air passage (108) therethrough, and where the annular air gasper knob extends about the air passage from a first annular end face (104) to a second annular end face (106); and
de_de: einen ringförmigen Frischluftleitungsknopf (102) aus einem UV-durchlässigen Material, wobei der ringförmige Frischluftleitungsknopf einen Luftdurchgang (108) durch ihn hindurch definiert und sich der ringförmige Frischluftleitungsknopf um den Luftdurchgang von einer ersten ringförmigen Endfläche (104) zu einer zweiten ringförmigen Endfläche (106) erstreckt; und
